In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(100)

In [39]:
dataku = pd.DataFrame(np.random.randn(4,5), ['A','B','C','D'],['satu','dua','tiga','empat','lima'])
# randn(rows,column) <- random angka, [list rows] <- index, [list column]

In [40]:
dataku

       satu       dua      tiga     empat      lima
A -1.497720 -1.193886  1.296263  0.952276 -1.217254
B -0.157265 -1.507585  0.107884  0.747056  0.429676
C -1.415043 -0.640760  0.779626 -0.438121  2.074793
D -0.343298 -0.616629  0.763184  0.192917 -0.348459

In [18]:
type(dataku['dua'])

pandas.core.series.Series

In [19]:
#iloc loc

In [58]:
dataku['baru'] = dataku['empat'] + dataku['lima']

In [59]:
dataku

       satu       dua      tiga     empat      lima      baru
A -1.497720 -1.193886  1.296263  0.952276 -1.217254 -0.264979
B -0.157265 -1.507585  0.107884  0.747056  0.429676  1.176732
C -1.415043 -0.640760  0.779626 -0.438121  2.074793  1.636672

In [60]:
dataku.drop('baru', axis=1, inplace=True) # klo ga disimpen ke variable nanti 
# ga ke simpen, tpi klo di inplace itu kesimpen sepaham aku
# axis jdi satu klo hapus kolom

In [48]:
dataku

       satu       dua      tiga     empat      lima
A -1.497720 -1.193886  1.296263  0.952276 -1.217254
B -0.157265 -1.507585  0.107884  0.747056  0.429676
C -1.415043 -0.640760  0.779626 -0.438121  2.074793
D -0.343298 -0.616629  0.763184  0.192917 -0.348459

In [54]:
dataku.drop('D', axis=0, inplace=True)   # axis jdi 0 klo buat hapus rows

In [55]:
dataku

       satu       dua      tiga     empat      lima
A -1.497720 -1.193886  1.296263  0.952276 -1.217254
B -0.157265 -1.507585  0.107884  0.747056  0.429676
C -1.415043 -0.640760  0.779626 -0.438121  2.074793

In [61]:
dataku.shape

(3, 5)

In [63]:
dataku_bol = dataku < 0 #buat liat data negatif atau positif atau di liat ke bool

In [65]:
dataku_bol # data nya jadi boolean

   satu   dua   tiga  empat   lima
A  True  True  False  False   True
B  True  True  False  False  False
C  True  True  False   True  False

In [68]:
dataku[dataku_bol] # yg kurang dri 0, bakal tampil, tpi yg lebih jdi NaN

       satu       dua  tiga     empat      lima
A -1.497720 -1.193886   NaN       NaN -1.217254
B -0.157265 -1.507585   NaN       NaN       NaN
C -1.415043 -0.640760   NaN -0.438121       NaN

In [79]:
dataku = pd.DataFrame(np.random.randn(4,5), ['A','B','C','D'],['satu','dua','tiga','empat','lima'])

In [80]:
dataku

       satu       dua      tiga     empat      lima
A  1.775994  0.513074  1.170527  2.077712 -0.455922
B  0.649173 -0.174782  1.017264 -0.599983  1.576167
C  0.604424 -0.907030  0.592023 -0.437064  0.101776
D  1.308347  1.387602 -1.735391  0.288377 -0.339085

In [87]:
dataku[dataku['tiga']>0] # jdi di kolom 3 cuma menampilkan yg lebih dri 0

       satu       dua      tiga     empat      lima
A  1.775994  0.513074  1.170527  2.077712 -0.455922
B  0.649173 -0.174782  1.017264 -0.599983  1.576167
C  0.604424 -0.907030  0.592023 -0.437064  0.101776

In [88]:
hasil = dataku[dataku['lima']>0] # di kolom ke lima yg datanya lebih dri 0

In [89]:
hasil

       satu       dua      tiga     empat      lima
B  0.649173 -0.174782  1.017264 -0.599983  1.576167
C  0.604424 -0.907030  0.592023 -0.437064  0.101776